espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_gpio.h
// Field:     [0] DIO24
//
// Sets the state of the pin that is configured as DIO#24, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT27_24_DIO24                                        0x00000001
#define GPIO_DOUT27_24_DIO24_BITN                                            0
#define GPIO_DOUT27_24_DIO24_M                                      0x00000001
#define GPIO_DOUT27_24_DIO24_S                                               0

//*****************************************************************************
//
// Register: GPIO_O_DOUT31_28
//
//*****************************************************************************
// Field:    [24] DIO31
//
// Sets the state of the pin that is configured as DIO#31, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT31_28_DIO31                                        0x01000000
#define GPIO_DOUT31_28_DIO31_BITN                                           24
#define GPIO_DOUT31_28_DIO31_M                                      0x01000000
#define GPIO_DOUT31_28_DIO31_S                                              24

// Field:    [16] DIO30
//
// Sets the state of the pin that is configured as DIO#30, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT31_28_DIO30                                        0x00010000
#define GPIO_DOUT31_28_DIO30_BITN                                           16
#define GPIO_DOUT31_28_DIO30_M                                      0x00010000
#define GPIO_DOUT31_28_DIO30_S                                              16

// Field:     [8] DIO29
//
// Sets the state of the pin that is configured as DIO#29, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT31_28_DIO29                                        0x00000100
#define GPIO_DOUT31_28_DIO29_BITN                                            8
#define GPIO_DOUT31_28_DIO29_M                                      0x00000100
#define GPIO_DOUT31_28_DIO29_S                                               8

// Field:     [0] DIO28
//
// Sets the state of the pin that is configured as DIO#28, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT31_28_DIO28                                        0x00000001
#define GPIO_DOUT31_28_DIO28_BITN                                            0
#define GPIO_DOUT31_28_DIO28_M                                      0x00000001
#define GPIO_DOUT31_28_DIO28_S                                               0

//*****************************************************************************
//
// Register: GPIO_O_DOUT35_32
//
//*****************************************************************************
// Field:    [24] DIO35
//
// Sets the state of the pin that is configured as DIO#35, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT35_32_DIO35                                        0x01000000
#define GPIO_DOUT35_32_DIO35_BITN                                           24
#define GPIO_DOUT35_32_DIO35_M                                      0x01000000
#define GPIO_DOUT35_32_DIO35_S                                              24

// Field:    [16] DIO34
//
// Sets the state of the pin that is configured as DIO#34, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT35_32_DIO34                                        0x00010000
#define GPIO_DOUT35_32_DIO34_BITN                                           16
#define GPIO_DOUT35_32_DIO34_M                                      0x00010000
#define GPIO_DOUT35_32_DIO34_S                                              16

// Field:     [8] DIO33
//
// Sets the state of the pin that is configured as DIO#33, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT35_32_DIO33                                        0x00000100
#define GPIO_DOUT35_32_DIO33_BITN                                            8
#define GPIO_DOUT35_32_DIO33_M                                      0x00000100
#define GPIO_DOUT35_32_DIO33_S                                               8

// Field:     [0] DIO32
//
// Sets the state of the pin that is configured as DIO#32, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT35_32_DIO32                                        0x00000001
#define GPIO_DOUT35_32_DIO32_BITN                                            0
#define GPIO_DOUT35_32_DIO32_M                                      0x00000001
#define GPIO_DOUT35_32_DIO32_S                                               0

//*****************************************************************************
//
// Register: GPIO_O_DOUT39_36
//
//*****************************************************************************
// Field:    [24] DIO39
//
// Sets the state of the pin that is configured as DIO#39, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT39_36_DIO39                                        0x01000000
#define GPIO_DOUT39_36_DIO39_BITN                                           24
#define GPIO_DOUT39_36_DIO39_M                                      0x01000000
#define GPIO_DOUT39_36_DIO39_S                                              24

// Field:    [16] DIO38
//
// Sets the state of the pin that is configured as DIO#38, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT39_36_DIO38                                        0x00010000
#define GPIO_DOUT39_36_DIO38_BITN                                           16
#define GPIO_DOUT39_36_DIO38_M                                      0x00010000
#define GPIO_DOUT39_36_DIO38_S                                              16

// Field:     [8] DIO37
//
// Sets the state of the pin that is configured as DIO#37, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT39_36_DIO37                                        0x00000100
#define GPIO_DOUT39_36_DIO37_BITN                                            8
#define GPIO_DOUT39_36_DIO37_M                                      0x00000100
#define GPIO_DOUT39_36_DIO37_S                                               8

// Field:     [0] DIO36
//
// Sets the state of the pin that is configured as DIO#36, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT39_36_DIO36                                        0x00000001
#define GPIO_DOUT39_36_DIO36_BITN                                            0
#define GPIO_DOUT39_36_DIO36_M                                      0x00000001
#define GPIO_DOUT39_36_DIO36_S                                               0

//*****************************************************************************
//
// Register: GPIO_O_DOUT43_40
//
//*****************************************************************************
// Field:    [24] DIO43
//
// Sets the state of the pin that is configured as DIO#43, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT43_40_DIO43                                        0x01000000
#define GPIO_DOUT43_40_DIO43_BITN                                           24
#define GPIO_DOUT43_40_DIO43_M                                      0x01000000
#define GPIO_DOUT43_40_DIO43_S                                              24

// Field:    [16] DIO42
//
// Sets the state of the pin that is configured as DIO#42, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT43_40_DIO42                                        0x00010000
#define GPIO_DOUT43_40_DIO42_BITN                                           16
#define GPIO_DOUT43_40_DIO42_M                                      0x00010000
#define GPIO_DOUT43_40_DIO42_S                                              16

