espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_gpio.h
// Field:     [8] DIO41
//
// Sets the state of the pin that is configured as DIO#41, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT43_40_DIO41                                        0x00000100
#define GPIO_DOUT43_40_DIO41_BITN                                            8
#define GPIO_DOUT43_40_DIO41_M                                      0x00000100
#define GPIO_DOUT43_40_DIO41_S                                               8

// Field:     [0] DIO40
//
// Sets the state of the pin that is configured as DIO#40, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT43_40_DIO40                                        0x00000001
#define GPIO_DOUT43_40_DIO40_BITN                                            0
#define GPIO_DOUT43_40_DIO40_M                                      0x00000001
#define GPIO_DOUT43_40_DIO40_S                                               0

//*****************************************************************************
//
// Register: GPIO_O_DOUT47_44
//
//*****************************************************************************
// Field:    [24] DIO47
//
// Sets the state of the pin that is configured as DIO#47, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT47_44_DIO47                                        0x01000000
#define GPIO_DOUT47_44_DIO47_BITN                                           24
#define GPIO_DOUT47_44_DIO47_M                                      0x01000000
#define GPIO_DOUT47_44_DIO47_S                                              24

// Field:    [16] DIO46
//
// Sets the state of the pin that is configured as DIO#46, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT47_44_DIO46                                        0x00010000
#define GPIO_DOUT47_44_DIO46_BITN                                           16
#define GPIO_DOUT47_44_DIO46_M                                      0x00010000
#define GPIO_DOUT47_44_DIO46_S                                              16

// Field:     [8] DIO45
//
// Sets the state of the pin that is configured as DIO#45, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT47_44_DIO45                                        0x00000100
#define GPIO_DOUT47_44_DIO45_BITN                                            8
#define GPIO_DOUT47_44_DIO45_M                                      0x00000100
#define GPIO_DOUT47_44_DIO45_S                                               8

// Field:     [0] DIO44
//
// Sets the state of the pin that is configured as DIO#44, if the corresponding
// DOE47_0 bitfield is set.
#define GPIO_DOUT47_44_DIO44                                        0x00000001
#define GPIO_DOUT47_44_DIO44_BITN                                            0
#define GPIO_DOUT47_44_DIO44_M                                      0x00000001
#define GPIO_DOUT47_44_DIO44_S                                               0

//*****************************************************************************
//
// Register: GPIO_O_DOUT31_0
//
//*****************************************************************************
// Field:    [31] DIO31
//
// Data output for DIO 31
#define GPIO_DOUT31_0_DIO31                                         0x80000000
#define GPIO_DOUT31_0_DIO31_BITN                                            31
#define GPIO_DOUT31_0_DIO31_M                                       0x80000000
#define GPIO_DOUT31_0_DIO31_S                                               31

// Field:    [30] DIO30
//
// Data output for DIO 30
#define GPIO_DOUT31_0_DIO30                                         0x40000000
#define GPIO_DOUT31_0_DIO30_BITN                                            30
#define GPIO_DOUT31_0_DIO30_M                                       0x40000000
#define GPIO_DOUT31_0_DIO30_S                                               30

// Field:    [29] DIO29
//
// Data output for DIO 29
#define GPIO_DOUT31_0_DIO29                                         0x20000000
#define GPIO_DOUT31_0_DIO29_BITN                                            29
#define GPIO_DOUT31_0_DIO29_M                                       0x20000000
#define GPIO_DOUT31_0_DIO29_S                                               29

// Field:    [28] DIO28
//
// Data output for DIO 28
#define GPIO_DOUT31_0_DIO28                                         0x10000000
#define GPIO_DOUT31_0_DIO28_BITN                                            28
#define GPIO_DOUT31_0_DIO28_M                                       0x10000000
#define GPIO_DOUT31_0_DIO28_S                                               28

// Field:    [27] DIO27
//
// Data output for DIO 27
#define GPIO_DOUT31_0_DIO27                                         0x08000000
#define GPIO_DOUT31_0_DIO27_BITN                                            27
#define GPIO_DOUT31_0_DIO27_M                                       0x08000000
#define GPIO_DOUT31_0_DIO27_S                                               27

// Field:    [26] DIO26
//
// Data output for DIO 26
#define GPIO_DOUT31_0_DIO26                                         0x04000000
#define GPIO_DOUT31_0_DIO26_BITN                                            26
#define GPIO_DOUT31_0_DIO26_M                                       0x04000000
#define GPIO_DOUT31_0_DIO26_S                                               26

// Field:    [25] DIO25
//
// Data output for DIO 25
#define GPIO_DOUT31_0_DIO25                                         0x02000000
#define GPIO_DOUT31_0_DIO25_BITN                                            25
#define GPIO_DOUT31_0_DIO25_M                                       0x02000000
#define GPIO_DOUT31_0_DIO25_S                                               25

// Field:    [24] DIO24
//
// Data output for DIO 24
#define GPIO_DOUT31_0_DIO24                                         0x01000000
#define GPIO_DOUT31_0_DIO24_BITN                                            24
#define GPIO_DOUT31_0_DIO24_M                                       0x01000000
#define GPIO_DOUT31_0_DIO24_S                                               24

