espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_gpio.h
// Field:    [19] DIO19
//
// Clears bit 19
#define GPIO_DOUTCLR31_0_DIO19                                      0x00080000
#define GPIO_DOUTCLR31_0_DIO19_BITN                                         19
#define GPIO_DOUTCLR31_0_DIO19_M                                    0x00080000
#define GPIO_DOUTCLR31_0_DIO19_S                                            19

// Field:    [18] DIO18
//
// Clears bit 18
#define GPIO_DOUTCLR31_0_DIO18                                      0x00040000
#define GPIO_DOUTCLR31_0_DIO18_BITN                                         18
#define GPIO_DOUTCLR31_0_DIO18_M                                    0x00040000
#define GPIO_DOUTCLR31_0_DIO18_S                                            18

// Field:    [17] DIO17
//
// Clears bit 17
#define GPIO_DOUTCLR31_0_DIO17                                      0x00020000
#define GPIO_DOUTCLR31_0_DIO17_BITN                                         17
#define GPIO_DOUTCLR31_0_DIO17_M                                    0x00020000
#define GPIO_DOUTCLR31_0_DIO17_S                                            17

// Field:    [16] DIO16
//
// Clears bit 16
#define GPIO_DOUTCLR31_0_DIO16                                      0x00010000
#define GPIO_DOUTCLR31_0_DIO16_BITN                                         16
#define GPIO_DOUTCLR31_0_DIO16_M                                    0x00010000
#define GPIO_DOUTCLR31_0_DIO16_S                                            16

// Field:    [15] DIO15
//
// Clears bit 15
#define GPIO_DOUTCLR31_0_DIO15                                      0x00008000
#define GPIO_DOUTCLR31_0_DIO15_BITN                                         15
#define GPIO_DOUTCLR31_0_DIO15_M                                    0x00008000
#define GPIO_DOUTCLR31_0_DIO15_S                                            15

// Field:    [14] DIO14
//
// Clears bit 14
#define GPIO_DOUTCLR31_0_DIO14                                      0x00004000
#define GPIO_DOUTCLR31_0_DIO14_BITN                                         14
#define GPIO_DOUTCLR31_0_DIO14_M                                    0x00004000
#define GPIO_DOUTCLR31_0_DIO14_S                                            14

// Field:    [13] DIO13
//
// Clears bit 13
#define GPIO_DOUTCLR31_0_DIO13                                      0x00002000
#define GPIO_DOUTCLR31_0_DIO13_BITN                                         13
#define GPIO_DOUTCLR31_0_DIO13_M                                    0x00002000
#define GPIO_DOUTCLR31_0_DIO13_S                                            13

// Field:    [12] DIO12
//
// Clears bit 12
#define GPIO_DOUTCLR31_0_DIO12                                      0x00001000
#define GPIO_DOUTCLR31_0_DIO12_BITN                                         12
#define GPIO_DOUTCLR31_0_DIO12_M                                    0x00001000
#define GPIO_DOUTCLR31_0_DIO12_S                                            12

// Field:    [11] DIO11
//
// Clears bit 11
#define GPIO_DOUTCLR31_0_DIO11                                      0x00000800
#define GPIO_DOUTCLR31_0_DIO11_BITN                                         11
#define GPIO_DOUTCLR31_0_DIO11_M                                    0x00000800
#define GPIO_DOUTCLR31_0_DIO11_S                                            11

// Field:    [10] DIO10
//
// Clears bit 10
#define GPIO_DOUTCLR31_0_DIO10                                      0x00000400
#define GPIO_DOUTCLR31_0_DIO10_BITN                                         10
#define GPIO_DOUTCLR31_0_DIO10_M                                    0x00000400
#define GPIO_DOUTCLR31_0_DIO10_S                                            10

// Field:     [9] DIO9
//
// Clears bit 9
#define GPIO_DOUTCLR31_0_DIO9                                       0x00000200
#define GPIO_DOUTCLR31_0_DIO9_BITN                                           9
#define GPIO_DOUTCLR31_0_DIO9_M                                     0x00000200
#define GPIO_DOUTCLR31_0_DIO9_S                                              9

// Field:     [8] DIO8
//
// Clears bit 8
#define GPIO_DOUTCLR31_0_DIO8                                       0x00000100
#define GPIO_DOUTCLR31_0_DIO8_BITN                                           8
#define GPIO_DOUTCLR31_0_DIO8_M                                     0x00000100
#define GPIO_DOUTCLR31_0_DIO8_S                                              8

// Field:     [7] DIO7
//
// Clears bit 7
#define GPIO_DOUTCLR31_0_DIO7                                       0x00000080
#define GPIO_DOUTCLR31_0_DIO7_BITN                                           7
#define GPIO_DOUTCLR31_0_DIO7_M                                     0x00000080
#define GPIO_DOUTCLR31_0_DIO7_S                                              7

// Field:     [6] DIO6
//
// Clears bit 6
#define GPIO_DOUTCLR31_0_DIO6                                       0x00000040
#define GPIO_DOUTCLR31_0_DIO6_BITN                                           6
#define GPIO_DOUTCLR31_0_DIO6_M                                     0x00000040
#define GPIO_DOUTCLR31_0_DIO6_S                                              6

// Field:     [5] DIO5
//
// Clears bit 5
#define GPIO_DOUTCLR31_0_DIO5                                       0x00000020
#define GPIO_DOUTCLR31_0_DIO5_BITN                                           5
#define GPIO_DOUTCLR31_0_DIO5_M                                     0x00000020
#define GPIO_DOUTCLR31_0_DIO5_S                                              5

// Field:     [4] DIO4
//
// Clears bit 4
#define GPIO_DOUTCLR31_0_DIO4                                       0x00000010
#define GPIO_DOUTCLR31_0_DIO4_BITN                                           4
#define GPIO_DOUTCLR31_0_DIO4_M                                     0x00000010
#define GPIO_DOUTCLR31_0_DIO4_S                                              4

// Field:     [3] DIO3
//
// Clears bit 3
#define GPIO_DOUTCLR31_0_DIO3                                       0x00000008
#define GPIO_DOUTCLR31_0_DIO3_BITN                                           3
#define GPIO_DOUTCLR31_0_DIO3_M                                     0x00000008
#define GPIO_DOUTCLR31_0_DIO3_S                                              3

// Field:     [2] DIO2
//
// Clears bit 2
#define GPIO_DOUTCLR31_0_DIO2                                       0x00000004
#define GPIO_DOUTCLR31_0_DIO2_BITN                                           2
#define GPIO_DOUTCLR31_0_DIO2_M                                     0x00000004
#define GPIO_DOUTCLR31_0_DIO2_S                                              2

// Field:     [1] DIO1
//
// Clears bit 1
#define GPIO_DOUTCLR31_0_DIO1                                       0x00000002
#define GPIO_DOUTCLR31_0_DIO1_BITN                                           1
#define GPIO_DOUTCLR31_0_DIO1_M                                     0x00000002
#define GPIO_DOUTCLR31_0_DIO1_S                                              1

// Field:     [0] DIO0
//
// Clears bit 0
#define GPIO_DOUTCLR31_0_DIO0                                       0x00000001
#define GPIO_DOUTCLR31_0_DIO0_BITN                                           0
#define GPIO_DOUTCLR31_0_DIO0_M                                     0x00000001
#define GPIO_DOUTCLR31_0_DIO0_S                                              0

//*****************************************************************************
//
// Register: GPIO_O_DOUTCLR47_32
//
//*****************************************************************************
// Field:    [15] DIO47
//
// Clears bit 47
#define GPIO_DOUTCLR47_32_DIO47                                     0x00008000
#define GPIO_DOUTCLR47_32_DIO47_BITN                                        15
#define GPIO_DOUTCLR47_32_DIO47_M                                   0x00008000
#define GPIO_DOUTCLR47_32_DIO47_S                                           15

// Field:    [14] DIO46
//
// Clears bit 46
#define GPIO_DOUTCLR47_32_DIO46                                     0x00004000
#define GPIO_DOUTCLR47_32_DIO46_BITN                                        14
#define GPIO_DOUTCLR47_32_DIO46_M                                   0x00004000
#define GPIO_DOUTCLR47_32_DIO46_S                                           14

// Field:    [13] DIO45
//
// Clears bit 45
#define GPIO_DOUTCLR47_32_DIO45                                     0x00002000
#define GPIO_DOUTCLR47_32_DIO45_BITN                                        13
#define GPIO_DOUTCLR47_32_DIO45_M                                   0x00002000
#define GPIO_DOUTCLR47_32_DIO45_S                                           13

// Field:    [12] DIO44
//
// Clears bit 44
#define GPIO_DOUTCLR47_32_DIO44                                     0x00001000
#define GPIO_DOUTCLR47_32_DIO44_BITN                                        12
#define GPIO_DOUTCLR47_32_DIO44_M                                   0x00001000
#define GPIO_DOUTCLR47_32_DIO44_S                                           12

// Field:    [11] DIO43
//
// Clears bit 43
#define GPIO_DOUTCLR47_32_DIO43                                     0x00000800
#define GPIO_DOUTCLR47_32_DIO43_BITN                                        11
#define GPIO_DOUTCLR47_32_DIO43_M                                   0x00000800
#define GPIO_DOUTCLR47_32_DIO43_S                                           11

// Field:    [10] DIO42
//
// Clears bit 42
#define GPIO_DOUTCLR47_32_DIO42                                     0x00000400
#define GPIO_DOUTCLR47_32_DIO42_BITN                                        10
#define GPIO_DOUTCLR47_32_DIO42_M                                   0x00000400
#define GPIO_DOUTCLR47_32_DIO42_S                                           10

// Field:     [9] DIO41
//
// Clears bit 41
#define GPIO_DOUTCLR47_32_DIO41                                     0x00000200
#define GPIO_DOUTCLR47_32_DIO41_BITN                                         9
#define GPIO_DOUTCLR47_32_DIO41_M                                   0x00000200
#define GPIO_DOUTCLR47_32_DIO41_S                                            9

// Field:     [8] DIO40
//
// Clears bit 40
#define GPIO_DOUTCLR47_32_DIO40                                     0x00000100
#define GPIO_DOUTCLR47_32_DIO40_BITN                                         8
#define GPIO_DOUTCLR47_32_DIO40_M                                   0x00000100
#define GPIO_DOUTCLR47_32_DIO40_S                                            8

// Field:     [7] DIO39
//
// Clears bit 39
#define GPIO_DOUTCLR47_32_DIO39                                     0x00000080
#define GPIO_DOUTCLR47_32_DIO39_BITN                                         7
#define GPIO_DOUTCLR47_32_DIO39_M                                   0x00000080
#define GPIO_DOUTCLR47_32_DIO39_S                                            7

// Field:     [6] DIO38
//
// Clears bit 38
#define GPIO_DOUTCLR47_32_DIO38                                     0x00000040
#define GPIO_DOUTCLR47_32_DIO38_BITN                                         6
#define GPIO_DOUTCLR47_32_DIO38_M                                   0x00000040
#define GPIO_DOUTCLR47_32_DIO38_S                                            6

// Field:     [5] DIO37
//
// Clears bit 37
#define GPIO_DOUTCLR47_32_DIO37                                     0x00000020
#define GPIO_DOUTCLR47_32_DIO37_BITN                                         5
#define GPIO_DOUTCLR47_32_DIO37_M                                   0x00000020
#define GPIO_DOUTCLR47_32_DIO37_S                                            5

// Field:     [4] DIO36
//
// Clears bit 36
#define GPIO_DOUTCLR47_32_DIO36                                     0x00000010
#define GPIO_DOUTCLR47_32_DIO36_BITN                                         4
#define GPIO_DOUTCLR47_32_DIO36_M                                   0x00000010
#define GPIO_DOUTCLR47_32_DIO36_S                                            4

