espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_gpio.h
// Field:     [3] DIO3
//
// Data output enable for DIO 3
#define GPIO_DOE31_0_DIO3                                           0x00000008
#define GPIO_DOE31_0_DIO3_BITN                                               3
#define GPIO_DOE31_0_DIO3_M                                         0x00000008
#define GPIO_DOE31_0_DIO3_S                                                  3

// Field:     [2] DIO2
//
// Data output enable for DIO 2
#define GPIO_DOE31_0_DIO2                                           0x00000004
#define GPIO_DOE31_0_DIO2_BITN                                               2
#define GPIO_DOE31_0_DIO2_M                                         0x00000004
#define GPIO_DOE31_0_DIO2_S                                                  2

// Field:     [1] DIO1
//
// Data output enable for DIO 1
#define GPIO_DOE31_0_DIO1                                           0x00000002
#define GPIO_DOE31_0_DIO1_BITN                                               1
#define GPIO_DOE31_0_DIO1_M                                         0x00000002
#define GPIO_DOE31_0_DIO1_S                                                  1

// Field:     [0] DIO0
//
// Data output enable for DIO 0
#define GPIO_DOE31_0_DIO0                                           0x00000001
#define GPIO_DOE31_0_DIO0_BITN                                               0
#define GPIO_DOE31_0_DIO0_M                                         0x00000001
#define GPIO_DOE31_0_DIO0_S                                                  0

//*****************************************************************************
//
// Register: GPIO_O_DOE47_32
//
//*****************************************************************************
// Field:    [15] DIO47
//
// Data output enable for DIO 47
#define GPIO_DOE47_32_DIO47                                         0x00008000
#define GPIO_DOE47_32_DIO47_BITN                                            15
#define GPIO_DOE47_32_DIO47_M                                       0x00008000
#define GPIO_DOE47_32_DIO47_S                                               15

// Field:    [14] DIO46
//
// Data output enable for DIO 46
#define GPIO_DOE47_32_DIO46                                         0x00004000
#define GPIO_DOE47_32_DIO46_BITN                                            14
#define GPIO_DOE47_32_DIO46_M                                       0x00004000
#define GPIO_DOE47_32_DIO46_S                                               14

// Field:    [13] DIO45
//
// Data output enable for DIO 45
#define GPIO_DOE47_32_DIO45                                         0x00002000
#define GPIO_DOE47_32_DIO45_BITN                                            13
#define GPIO_DOE47_32_DIO45_M                                       0x00002000
#define GPIO_DOE47_32_DIO45_S                                               13

// Field:    [12] DIO44
//
// Data output enable for DIO 44
#define GPIO_DOE47_32_DIO44                                         0x00001000
#define GPIO_DOE47_32_DIO44_BITN                                            12
#define GPIO_DOE47_32_DIO44_M                                       0x00001000
#define GPIO_DOE47_32_DIO44_S                                               12

// Field:    [11] DIO43
//
// Data output enable for DIO 43
#define GPIO_DOE47_32_DIO43                                         0x00000800
#define GPIO_DOE47_32_DIO43_BITN                                            11
#define GPIO_DOE47_32_DIO43_M                                       0x00000800
#define GPIO_DOE47_32_DIO43_S                                               11

// Field:    [10] DIO42
//
// Data output enable for DIO 42
#define GPIO_DOE47_32_DIO42                                         0x00000400
#define GPIO_DOE47_32_DIO42_BITN                                            10
#define GPIO_DOE47_32_DIO42_M                                       0x00000400
#define GPIO_DOE47_32_DIO42_S                                               10

// Field:     [9] DIO41
//
// Data output enable for DIO 41
#define GPIO_DOE47_32_DIO41                                         0x00000200
#define GPIO_DOE47_32_DIO41_BITN                                             9
#define GPIO_DOE47_32_DIO41_M                                       0x00000200
#define GPIO_DOE47_32_DIO41_S                                                9

// Field:     [8] DIO40
//
// Data output enable for DIO 40
#define GPIO_DOE47_32_DIO40                                         0x00000100
#define GPIO_DOE47_32_DIO40_BITN                                             8
#define GPIO_DOE47_32_DIO40_M                                       0x00000100
#define GPIO_DOE47_32_DIO40_S                                                8

// Field:     [7] DIO39
//
// Data output enable for DIO 39
#define GPIO_DOE47_32_DIO39                                         0x00000080
#define GPIO_DOE47_32_DIO39_BITN                                             7
#define GPIO_DOE47_32_DIO39_M                                       0x00000080
#define GPIO_DOE47_32_DIO39_S                                                7

// Field:     [6] DIO38
//
// Data output enable for DIO 38
#define GPIO_DOE47_32_DIO38                                         0x00000040
#define GPIO_DOE47_32_DIO38_BITN                                             6
#define GPIO_DOE47_32_DIO38_M                                       0x00000040
#define GPIO_DOE47_32_DIO38_S                                                6

// Field:     [5] DIO37
//
// Data output enable for DIO 37
#define GPIO_DOE47_32_DIO37                                         0x00000020
#define GPIO_DOE47_32_DIO37_BITN                                             5
#define GPIO_DOE47_32_DIO37_M                                       0x00000020
#define GPIO_DOE47_32_DIO37_S                                                5

// Field:     [4] DIO36
//
// Data output enable for DIO 36
#define GPIO_DOE47_32_DIO36                                         0x00000010
#define GPIO_DOE47_32_DIO36_BITN                                             4
#define GPIO_DOE47_32_DIO36_M                                       0x00000010
#define GPIO_DOE47_32_DIO36_S                                                4

