espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_gpio.h
// Field:     [3] DIO35
//
// Event for DIO 35
#define GPIO_EVFLAGS47_32_DIO35                                     0x00000008
#define GPIO_EVFLAGS47_32_DIO35_BITN                                         3
#define GPIO_EVFLAGS47_32_DIO35_M                                   0x00000008
#define GPIO_EVFLAGS47_32_DIO35_S                                            3

// Field:     [2] DIO34
//
// Event for DIO 34
#define GPIO_EVFLAGS47_32_DIO34                                     0x00000004
#define GPIO_EVFLAGS47_32_DIO34_BITN                                         2
#define GPIO_EVFLAGS47_32_DIO34_M                                   0x00000004
#define GPIO_EVFLAGS47_32_DIO34_S                                            2

// Field:     [1] DIO33
//
// Event for DIO 33
#define GPIO_EVFLAGS47_32_DIO33                                     0x00000002
#define GPIO_EVFLAGS47_32_DIO33_BITN                                         1
#define GPIO_EVFLAGS47_32_DIO33_M                                   0x00000002
#define GPIO_EVFLAGS47_32_DIO33_S                                            1

// Field:     [0] DIO32
//
// Event for DIO 32
#define GPIO_EVFLAGS47_32_DIO32                                     0x00000001
#define GPIO_EVFLAGS47_32_DIO32_BITN                                         0
#define GPIO_EVFLAGS47_32_DIO32_M                                   0x00000001
#define GPIO_EVFLAGS47_32_DIO32_S                                            0


#endif // __GPIO__
